/*******************************************************
*************VH电压,热敏值,红外集电极电压取样***********
***************软件版本2R_V3_0**************************
*@u8	VH_Test(void);
*@读取ADC取样值，并计算
*@VH电压：
*				读取ADC_Num[1]的值并进行电压换算
*				储存在Detect_USART[0]与UpStartUSART[11]进行判断
*							 			返回结果:									
*										正确Correct  		 		0x11
*										错误Error		 				0xAA
*******************************************************/
/******************************************************
*@u8	TM_Test(void);
*@读取ADC取样值，并计算
*@TM,TPH3950热敏电压：
*				读取ADC_Num[5]的值并进行电压换算
*				储存在Detect_USART[1]与正常温度进行判断5~50
*							 			返回结果:									
*										正确Correct  		 		0x11
*										错误Error		 				0xAA
*******************************************************/
/******************************************************
*@u8	RAY_Test(void);
*@读取红外集电极取样值
*@CE电压：
*				读取ADC_Num[2]的值并进行电压换算
*				储存在Detect_USART[2]与设定值进行判断小于0.8V
*							 			返回结果:									
*										正确Correct  		 		0x11
*										错误Error		 				0xAA
*******************************************************/

/****************************************
u16	ADC_Num[3]:									//ADC缓存
*							ADC_Num[0]				//VH电压取样ADC
*							ADC_Num[1]				//红外光耦电压取样ADC
*							ADC_Num[2]				//TPH热敏电压取样ADC
****************************************/



#ifndef __DETECT_ADC_H_
#define __DETECT_ADC_H_

#include	"Config.h"

u8	VH_Test(void);
u8	TM_Test(void);
u8	RAY_Test(void);

#endif /* __DETECT_ADC_H_ */





